/*
3.3 โจทย์ข้อนี้จะลองให้เพื่อนๆออกแบบตัวแปร และโฟลของโคดกันเอง
 ธนาคารต้องการโปรแกรมสำหรับเอาไว้ให้ลูกค้า จ่ายหนี้สินที่ค้างไว้อยู่
โดยในระบบมีคนที่ยืมเงินไป 3 คนคือ
   นาย A  idใบชำระหนี้ 01  ยอดค้างชำระ 2000
   นาย B idใบชำระหนี้ 02  ยอดค้างชำระ 3000
   นาย C idใบชำระหนี้ 03  ยอดค้างชำระ 4000

   ธนาคารต้องการโปรแกรมที่ถามหาidชำระหนี้ และต้องรอให้ลูกค้ายืนยันก่อนว่าเค้าเป็นเจ้าของธุรกรรมโดยแจ้งชื่อเจ้าของไอดีที่กรอกมา
   ถ้ายืนยันว่าเป็นเจ้าของ ระบบจะโชว์ยอดค้างชำระ และ มีการถามถึงยอดที่ต้องการชำระ มีการรอการยืนยีนว่าจะชำระ ถ้ายืนยันการชำระ จะมีการแจ้งยอดหนี้คงเหลือ แล้วกร่าวขอบคุณกับเจ้าของ
   บัญชี

*/
let name;
let id;
let totalDept;
let checkName;
let paymentAmount;
let acceptPayment;

id = prompt("โปรดกรอกหมายเลข id ที่คุณต้องการชำระ");

if (id === "01") {
  name = "A";
  totalDept = 2000;
}

if (id === "02") {
  name = "B";
  totalDept = 3000;
}

if (id === "03") {
  name = "C";
  totalDept = 4000;
}

checkName = prompt(
  "ยืนยันว่าคุณต้องการชำระธุระกรรมของ นาย" + name + "โปรดตอบว่า ใช่ หรือไม่ใช่"
);

if (checkName === "ใช่") {
  alert("ยอดเงินค้างชำระรวม" + totalDept);
  paymentAmount = prompt("โปรดระบุยอดเงินที่ต้องการชำระ");
  acceptPayment = prompt("ยืนยันการชำระรึป่าว ตอบว่า ใช่ หรือไม่ใช่");
}

if (acceptPayment === "ใช่") {
  alert("ยอดค้างชำระของคุณคงเหลือ" + (totalDept -= paymentAmount));
  alert("ขอบคุณคุณ" + name + "ที่ชำระเงินเข้ามา");
}
