/*
3.3 โจทย์ข้อนี้จะลองให้เพื่อนๆออกแบบตัวแปร และโฟลของโคดกันเอง
 ธนาคารต้องการโปรแกรมสำหรับเอาไว้ให้ลูกค้า จ่ายหนี้สินที่ค้างไว้อยู่
โดยในระบบมีคนที่ยืมเงินไป 3 คนคือ
   นาย A  idใบชำระหนี้ 01  ยอดค้างชำระ 2000
   นาย B idใบชำระหนี้ 02  ยอดค้างชำระ 3000
   นาย C idใบชำระหนี้ 03  ยอดค้างชำระ 4000

   ธนาคารต้องการโปรแกรมที่ถามหาidชำระหนี้ และต้องรอให้ลูกค้ายืนยันก่อนว่าเค้าเป็นเจ้าของธุรกรรมโดยแจ้งชื่อเจ้าของไอดีที่กรอกมา
   ถ้ายืนยันว่าเป็นเจ้าของ ระบบจะโชว์ยอดค้างชำระ และ มีการถามถึงยอดที่ต้องการชำระ มีการรอการยืนยีนว่าจะชำระ ถ้ายืนยันการชำระ จะมีการแจ้งยอดหนี้คงเหลือ แล้วกร่าวขอบคุณกับเจ้าของ
   บัญชี

*/
